{
    "vision_config": {
        "return_dict": true,
        "output_hidden_states": false,
        "torchscript": false,
        "torch_dtype": null,
        "use_bfloat16": false,
        "tf_legacy_loss": false,
        "pruned_heads": {},
        "tie_word_embeddings": true,
        "chunk_size_feed_forward": 0,
        "is_encoder_decoder": false,
        "is_decoder": false,
        "cross_attention_hidden_size": null,
        "add_cross_attention": false,
        "tie_encoder_decoder": false,
        "max_length": 20,
        "min_length": 0,
        "do_sample": false,
        "early_stopping": false,
        "num_beams": 1,
        "num_beam_groups": 1,
        "diversity_penalty": 0.0,
        "temperature": 1.0,
        "top_k": 50,
        "top_p": 1.0,
        "typical_p": 1.0,
        "repetition_penalty": 1.0,
        "length_penalty": 1.0,
        "no_repeat_ngram_size": 0,
        "encoder_no_repeat_ngram_size": 0,
        "bad_words_ids": null,
        "num_return_sequences": 1,
        "output_scores": false,
        "return_dict_in_generate": false,
        "forced_bos_token_id": null,
        "forced_eos_token_id": null,
        "remove_invalid_values": false,
        "exponential_decay_length_penalty": null,
        "suppress_tokens": null,
        "begin_suppress_tokens": null,
        "architectures": null,
        "finetuning_task": null,
        "id2label": {
            "0": "LABEL_0",
            "1": "LABEL_1"
        },
        "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1
        },
        "tokenizer_class": null,
        "prefix": null,
        "bos_token_id": null,
        "pad_token_id": null,
        "eos_token_id": null,
        "sep_token_id": null,
        "decoder_start_token_id": null,
        "task_specific_params": null,
        "problem_type": null,
        "_name_or_path": "",
        "in_chans": 3,
        "spatial_patch_size": 14,
        "depth": 32,
        "hidden_size": 1280,
        "hidden_act": "silu",
        "intermediate_size": 3420,
        "num_heads": 16,
        "in_channels": 3,
        "patch_size": 14,
        "spatial_merge_size": 2,
        "temporal_patch_size": 2,
        "tokens_per_second": 2,
        "window_size": 112,
        "fullatt_block_indexes": [
            7,
            15,
            23,
            31
        ],
        "out_hidden_size": 2048,
        "initializer_range": 0.02,
        "model_type": "qwen2_5_vl",
        "output_attentions": false
    },
    "text_config": {
        "vocab_size": 151936,
        "max_position_embeddings": 128000,
        "hidden_size": 2048,
        "intermediate_size": 11008,
        "num_hidden_layers": 36,
        "num_attention_heads": 16,
        "use_sliding_window": false,
        "sliding_window": null,
        "max_window_layers": 70,
        "num_key_value_heads": 2,
        "hidden_act": "silu",
        "initializer_range": 0.02,
        "rms_norm_eps": 1e-06,
        "use_cache": true,
        "rope_theta": 1000000.0,
        "attention_dropout": 0.0,
        "rope_scaling": {
            "type": "default",
            "mrope_section": [
                16,
                24,
                24
            ],
            "rope_type": "default"
        },
        "layer_types": [
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention"
        ],
        "image_token_id": null,
        "video_token_id": null,
        "return_dict": true,
        "output_hidden_states": false,
        "torchscript": false,
        "torch_dtype": "bfloat16",
        "use_bfloat16": false,
        "tf_legacy_loss": false,
        "pruned_heads": {},
        "tie_word_embeddings": true,
        "chunk_size_feed_forward": 0,
        "is_encoder_decoder": false,
        "is_decoder": false,
        "cross_attention_hidden_size": null,
        "add_cross_attention": false,
        "tie_encoder_decoder": false,
        "max_length": 20,
        "min_length": 0,
        "do_sample": false,
        "early_stopping": false,
        "num_beams": 1,
        "num_beam_groups": 1,
        "diversity_penalty": 0.0,
        "temperature": 1.0,
        "top_k": 50,
        "top_p": 1.0,
        "typical_p": 1.0,
        "repetition_penalty": 1.0,
        "length_penalty": 1.0,
        "no_repeat_ngram_size": 0,
        "encoder_no_repeat_ngram_size": 0,
        "bad_words_ids": null,
        "num_return_sequences": 1,
        "output_scores": false,
        "return_dict_in_generate": false,
        "forced_bos_token_id": null,
        "forced_eos_token_id": null,
        "remove_invalid_values": false,
        "exponential_decay_length_penalty": null,
        "suppress_tokens": null,
        "begin_suppress_tokens": null,
        "architectures": [
            "Qwen2_5_VLForConditionalGeneration"
        ],
        "finetuning_task": null,
        "id2label": {
            "0": "LABEL_0",
            "1": "LABEL_1"
        },
        "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1
        },
        "tokenizer_class": null,
        "prefix": null,
        "bos_token_id": 151643,
        "pad_token_id": null,
        "eos_token_id": 151645,
        "sep_token_id": null,
        "decoder_start_token_id": null,
        "task_specific_params": null,
        "problem_type": null,
        "_name_or_path": "",
        "vision_start_token_id": 151652,
        "vision_end_token_id": 151653,
        "vision_token_id": 151654,
        "model_type": "qwen2_5_vl_text",
        "output_attentions": false
    },
    "image_token_id": 151655,
    "video_token_id": 151656,
    "return_dict": true,
    "output_hidden_states": false,
    "torchscript": false,
    "torch_dtype": "bfloat16",
    "use_bfloat16": false,
    "tf_legacy_loss": false,
    "pruned_heads": {},
    "tie_word_embeddings": true,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": null,
    "architectures": [
        "Qwen2_5_VLForConditionalGeneration"
    ],
    "finetuning_task": null,
    "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
    },
    "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
    },
    "tokenizer_class": null,
    "prefix": null,
    "bos_token_id": 151643,
    "pad_token_id": null,
    "eos_token_id": 151645,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "task_specific_params": null,
    "problem_type": null,
    "_name_or_path": "Qwen/Qwen2.5-VL-3B-Instruct",
    "transformers_version": "4.54.0.dev0",
    "attention_dropout": 0.0,
    "vision_start_token_id": 151652,
    "vision_end_token_id": 151653,
    "vision_token_id": 151654,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "initializer_range": 0.02,
    "intermediate_size": 11008,
    "max_position_embeddings": 128000,
    "max_window_layers": 70,
    "model_type": "qwen2_5_vl",
    "num_attention_heads": 16,
    "num_hidden_layers": 36,
    "num_key_value_heads": 2,
    "rms_norm_eps": 1e-06,
    "rope_theta": 1000000.0,
    "sliding_window": 32768,
    "use_cache": true,
    "use_sliding_window": false,
    "rope_scaling": {
        "type": "default",
        "mrope_section": [
            16,
            24,
            24
        ],
        "rope_type": "default"
    },
    "vocab_size": 151936,
    "quantization_config": {
        "quant_method": "bitsandbytes",
        "_load_in_8bit": false,
        "_load_in_4bit": true,
        "llm_int8_threshold": 6.0,
        "llm_int8_skip_modules": null,
        "llm_int8_enable_fp32_cpu_offload": false,
        "llm_int8_has_fp16_weight": false,
        "bnb_4bit_quant_type": "nf4",
        "bnb_4bit_use_double_quant": true,
        "bnb_4bit_compute_dtype": "float32",
        "bnb_4bit_quant_storage": "uint8",
        "load_in_4bit": true,
        "load_in_8bit": false
    },
    "output_attentions": false
}